espressif/esp-idf/components/soc/esp32c61/register/soc/i2s_reg.h
/** I2S_STATE_REG register
 *  I2S TX status register
 */
#define I2S_STATE_REG (DR_REG_I2S_BASE + 0x6c)
/** I2S_TX_IDLE : RO; bitpos: [0]; default: 1;
 *  1: i2s_tx is idle state. 0: i2s_tx is working.
 */
#define I2S_TX_IDLE    (BIT(0))
#define I2S_TX_IDLE_M  (I2S_TX_IDLE_V << I2S_TX_IDLE_S)
#define I2S_TX_IDLE_V  0x00000001U
#define I2S_TX_IDLE_S  0

/** I2S_ETM_CONF_REG register
 *  I2S ETM configure register
 */
#define I2S_ETM_CONF_REG (DR_REG_I2S_BASE + 0x70)
/** I2S_ETM_TX_SEND_WORD_NUM : R/W; bitpos: [9:0]; default: 64;
 *  I2S ETM send x words event. When sending word number of
 *  reg_etm_tx_send_word_num[9:0], i2s will trigger an etm event.
 */
#define I2S_ETM_TX_SEND_WORD_NUM    0x000003FFU
#define I2S_ETM_TX_SEND_WORD_NUM_M  (I2S_ETM_TX_SEND_WORD_NUM_V << I2S_ETM_TX_SEND_WORD_NUM_S)
#define I2S_ETM_TX_SEND_WORD_NUM_V  0x000003FFU
#define I2S_ETM_TX_SEND_WORD_NUM_S  0
/** I2S_ETM_RX_RECEIVE_WORD_NUM : R/W; bitpos: [19:10]; default: 64;
 *  I2S ETM receive x words event. When receiving word number of
 *  reg_etm_rx_receive_word_num[9:0], i2s will trigger an etm event.
 */
#define I2S_ETM_RX_RECEIVE_WORD_NUM    0x000003FFU
#define I2S_ETM_RX_RECEIVE_WORD_NUM_M  (I2S_ETM_RX_RECEIVE_WORD_NUM_V << I2S_ETM_RX_RECEIVE_WORD_NUM_S)
#define I2S_ETM_RX_RECEIVE_WORD_NUM_V  0x000003FFU
#define I2S_ETM_RX_RECEIVE_WORD_NUM_S  10

/** I2S_FIFO_CNT_REG register
 *  I2S sync counter register
 */
#define I2S_FIFO_CNT_REG (DR_REG_I2S_BASE + 0x74)
/** I2S_TX_FIFO_CNT : RO; bitpos: [30:0]; default: 0;
 *  tx fifo counter value.
 */
#define I2S_TX_FIFO_CNT    0x7FFFFFFFU
#define I2S_TX_FIFO_CNT_M  (I2S_TX_FIFO_CNT_V << I2S_TX_FIFO_CNT_S)
#define I2S_TX_FIFO_CNT_V  0x7FFFFFFFU
#define I2S_TX_FIFO_CNT_S  0
/** I2S_TX_FIFO_CNT_RST : WT; bitpos: [31]; default: 0;
 *  Set this bit to reset tx fifo counter.
 */
#define I2S_TX_FIFO_CNT_RST    (BIT(31))
#define I2S_TX_FIFO_CNT_RST_M  (I2S_TX_FIFO_CNT_RST_V << I2S_TX_FIFO_CNT_RST_S)
#define I2S_TX_FIFO_CNT_RST_V  0x00000001U
#define I2S_TX_FIFO_CNT_RST_S  31

/** I2S_BCK_CNT_REG register
 *  I2S sync counter register
 */
#define I2S_BCK_CNT_REG (DR_REG_I2S_BASE + 0x78)
/** I2S_TX_BCK_CNT : RO; bitpos: [30:0]; default: 0;
 *  tx bck counter value.
 */
#define I2S_TX_BCK_CNT    0x7FFFFFFFU
#define I2S_TX_BCK_CNT_M  (I2S_TX_BCK_CNT_V << I2S_TX_BCK_CNT_S)
#define I2S_TX_BCK_CNT_V  0x7FFFFFFFU
#define I2S_TX_BCK_CNT_S  0
/** I2S_TX_BCK_CNT_RST : WT; bitpos: [31]; default: 0;
 *  Set this bit to reset tx bck counter.
 */
#define I2S_TX_BCK_CNT_RST    (BIT(31))
#define I2S_TX_BCK_CNT_RST_M  (I2S_TX_BCK_CNT_RST_V << I2S_TX_BCK_CNT_RST_S)
#define I2S_TX_BCK_CNT_RST_V  0x00000001U
#define I2S_TX_BCK_CNT_RST_S  31

/** I2S_CLK_GATE_REG register
 *  Clock gate register
 */
#define I2S_CLK_GATE_REG (DR_REG_I2S_BASE + 0x7c)
/** I2S_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  set this bit to enable clock gate
 */
#define I2S_CLK_EN    (BIT(0))
#define I2S_CLK_EN_M  (I2S_CLK_EN_V << I2S_CLK_EN_S)
#define I2S_CLK_EN_V  0x00000001U
#define I2S_CLK_EN_S  0

/** I2S_DATE_REG register
 *  Version control register
 */
#define I2S_DATE_REG (DR_REG_I2S_BASE + 0x80)
/** I2S_DATE : R/W; bitpos: [27:0]; default: 36713024;
 *  I2S version control register
 */
#define I2S_DATE    0x0FFFFFFFU
#define I2S_DATE_M  (I2S_DATE_V << I2S_DATE_S)
#define I2S_DATE_V  0x0FFFFFFFU
#define I2S_DATE_S  0

#ifdef __cplusplus
}
#endif
